{
  "posts": [
    {
      "id": "99f8add4-7684-4c16-a316-616271db199e",
      "title": "A formação das estrelas em nebulosas gigantes",
      "slug": "formacao-das-estrelas-em-nebulosas-gigantes",
      "excerpt": "Estrelas nascem dentro de nuvens densas de poeira e gás, onde a gravidade inicia um processo fascinante de colapso e aquecimento.",
      "content": "As nebulosas são verdadeiros berçários cósmicos. Em seu interior, regiões ricas em hidrogênio se contraem até atingir temperaturas extremas, dando origem a novas estrelas que iluminam o espaço ao redor.",
      "coverImageUrl": "/image/img-2.avif",
      "published": true,
      "createdAt": "2025-04-08T00:24:38.616Z",
      "updatedAt": "2025-04-08T00:33:56.907Z",
      "author": "Isabela Nunes"
    },
    {
      "id": "afa086e4-53e4-492d-acf2-7c2966d83fcd",
      "title": "Como os buracos negros influenciam galáxias inteiras",
      "slug": "como-os-buracos-negros-influenciam-galaxias-inteiras",
      "excerpt": "Buracos negros supermassivos exercem forças que moldam o comportamento de estrelas, poeira e gases ao seu redor.",
      "content": "No centro da maioria das galáxias existe um buraco negro gigantesco. Mesmo invisíveis, eles controlam órbitas, emitem jatos de partículas e até regulam a formação de novas estrelas.",
      "coverImageUrl": "/image/img-3.avif",
      "published": true,
      "createdAt": "2025-04-07T00:24:38.616Z",
      "updatedAt": "2025-04-07T00:33:56.907Z",
      "author": "Marina Duarte"
    },
    {
      "id": "1b6a5f57-8a19-4933-91f4-1af678464ded",
      "title": "A jornada da luz: como viajamos para o passado observando o universo",
      "slug": "a-jornada-da-luz-observando-o-passado",
      "excerpt": "A luz leva bilhões de anos para chegar até nós, revelando como o universo era em épocas distantes.",
      "content": "Quando observamos estrelas e galáxias distantes, estamos olhando para o passado. A velocidade limitada da luz transforma o telescópio em uma verdadeira máquina do tempo.",
      "coverImageUrl": "/image/img-4.avif",
      "published": true,
      "createdAt": "2025-04-06T00:24:38.616Z",
      "updatedAt": "2025-04-06T00:33:56.907Z",
      "author": "Pedro Martins"
    },
    {
      "id": "9eb8b7ac-2b48-4835-880a-a1c798e1a595",
      "slug": "ondas-gravitacionais-e-os-segredos-do-cosmo",
      "title": "Ondas gravitacionais e os segredos escondidos do espaço-tempo",
      "author": "Luiz Otávio",
      "content": "Ondas gravitacionais são distorções no próprio tecido do espaço-tempo, criadas por eventos extremos como fusões de buracos negros. Elas carregam informações únicas sobre regiões onde a luz não escapa.",
      "excerpt": "Detectar ondas gravitacionais abriu uma nova forma de estudar o universo, indo além da luz e revelando fenômenos antes invisíveis.",
      "coverImageUrl": "/image/img-5.avif",
      "published": true,
      "createdAt": "2025-04-05T00:24:38.616Z",
      "updatedAt": "2025-04-05T00:33:56.907Z"
    },
    {
      "id": "6b204dab-2312-4525-820a-a0463560835f",
      "title": "Supernovas: o explosivo fim das estrelas massivas",
      "slug": "supernovas-o-fim-explosivo-das-estrelas",
      "excerpt": "Quando estrelas gigantes chegam ao fim de sua vida, elas explodem violentamente, espalhando elementos que formam planetas e até a vida.",
      "content": "As supernovas são alguns dos eventos mais poderosos do cosmos. Além de liberar energia inimaginável, elas espalham metais pesados essenciais para a formação de novos sistemas estelares.",
      "coverImageUrl": "/image/img-6.avif",
      "published": false,
      "createdAt": "2025-03-30T07:11:33",
      "updatedAt": "2025-04-05T00:14:03.175Z",
      "author": "Lucas Lima"
    },
    {
      "id": "76396dd3-9581-43b5-856d-fe1a78714e8c",
      "title": "A dança das galáxias: colisões que criam novos mundos",
      "slug": "danca-das-galaxias-colisoes-cosmic",
      "excerpt": "Galáxias podem colidir e se fundir, formando estruturas ainda maiores e desencadeando intensos surtos de formação estelar.",
      "content": "Apesar do nome assustador, colisões galácticas são comuns no universo e ocorrem em escalas de bilhões de anos. Esses encontros remodelam o cosmos e dão origem a novos sistemas estelares.",
      "coverImageUrl": "/image/img-7.avif",
      "published": true,
      "createdAt": "2025-03-08T13:13:13",
      "updatedAt": "2025-03-08T13:13:13",
      "author": "João Silva"
    },
    {
      "id": "bf5c7dae-06a4-4155-9c01-a56e02956496",
      "title": "Exoplanetas: mundos além do nosso sistema solar",
      "slug": "exoplanetas-mundos-alem-do-sistema-solar",
      "excerpt": "O universo está repleto de planetas orbitando outras estrelas, muitos deles totalmente diferentes da Terra.",
      "content": "Graças à tecnologia moderna, já identificamos milhares de exoplanetas. Alguns são gigantes gasosos próximos à estrela; outros, mundos rochosos que podem abrigar vida.",
      "coverImageUrl": "/image/img-8.avif",
      "published": true,
      "createdAt": "2025-02-22T04:32:54",
      "updatedAt": "2025-02-22T04:32:54",
      "author": "Ana Costa"
    },
    {
      "id": "bc9a540f-66a9-4ab0-8d50-6216ab1cac53",
      "title": "Cometas: viajantes antigos do sistema solar",
      "slug": "cometas-viajantes-do-sistema-solar",
      "excerpt": "Compostos de gelo e poeira, cometas viajam por órbitas imensas trazendo pistas sobre a infância do sistema solar.",
      "content": "Cometas se formaram nas regiões mais distantes do Sol e preservaram materiais primordiais. Quando se aproximam, suas caudas brilhantes tornam-se visíveis a partir da Terra.",
      "coverImageUrl": "/image/img-9.avif",
      "published": true,
      "createdAt": "2025-02-11T20:59:30",
      "updatedAt": "2025-02-11T20:59:30",
      "author": "Thiago Ribeiro"
    },
    {
      "id": "3993fcf7-2490-48ed-be2e-58c2030ee764",
      "title": "Nebulosas planetárias: o último suspiro das estrelas médias",
      "slug": "nebulosas-planetarias-ultimo-suspiro",
      "excerpt": "Nebulosas planetárias são formadas quando estrelas como o Sol expulsam suas camadas externas, criando estruturas brilhantes e coloridas.",
      "content": "Esses objetos encantadores não têm relação com planetas — o nome vem de erros antigos de classificação. Elas representam um estágio final antes de a estrela se tornar uma anã branca.",
      "coverImageUrl": "/image/img-10.avif",
      "published": true,
      "createdAt": "2025-01-15T04:54:26",
      "updatedAt": "2025-01-15T00:54:26",
      "author": "Bianca Rocha"
    },
    {
      "id": "be3f14a1-0105-4e2e-bfc9-133a05e7bda6",
      "title": "Pulsars: os faróis do universo",
      "slug": "pulsars-os-farois-do-universo",
      "excerpt": "Pulsars são estrelas de nêutrons que giram rapidamente, emitindo feixes de radiação detectados da Terra como pulsos regulares.",
      "content": "Remanescentes de supernovas, os pulsars são alguns dos objetos mais densos conhecidos. Sua rotação precisa os torna ferramentas valiosas para estudar física extrema.",
      "coverImageUrl": "/image/img-11.avif",
      "published": false,
      "createdAt": "2025-01-07T22:54:10",
      "updatedAt": "2025-01-07T22:54:10",
      "author": "Carla Mendes"
    }
  ]
}
